In [1]:
import numpy as np
import pandas as pd

In [3]:
df = pd.read_csv("Churn.csv")
df.head()

,state,account length,area code,phone number,international plan,voice mail plan,number vmail messages,total day minutes,total day calls,total day charge,...,total eve calls,total eve charge,total night minutes,total night calls,total night charge,total intl minutes,total intl calls,total intl charge,customer service calls,churn
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False

Pandas offers 4 Primary methods to select items:

1.**Dot Notation**: Select a single column
2.**loc**: select based on column names and index name.
3.**iloc**: select based on the column number and row number.
4.**iat**: select on item only based on column and row number.

**Dot Notation**

Select one column only as a reference

In [9]:
df.state

0       KS
1       OH
2       NJ
3       OH
4       OK
        ..
3328    AZ
3329    WV
3330    RI
3331    CT
3332    TN
Name: state, Length: 3333, dtype: object

The object returned on selecting just one column is  called a pands series

In [15]:
df.state_num = 1

In [17]:
df.head()

,state,account length,area code,phone number,international plan,voice mail plan,number vmail messages,total day minutes,total day calls,total day charge,...,total eve calls,total eve charge,total night minutes,total night calls,total night charge,total intl minutes,total intl calls,total intl charge,customer service calls,churn
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False

In [12]:
type(df.state)

pandas.core.series.Series

The dot notation can't be used for column names that contains a space character.

**.loc example**

.loc takes 2 arguments inside the square brackets. One for the index names (row names) and another one for columns names

In [21]:
df['state']

0       KS
1       OH
2       NJ
3       OH
4       OK
        ..
3328    AZ
3329    WV
3330    RI
3331    CT
3332    TN
Name: state, Length: 3333, dtype: object

In [23]:
df.loc[:, 'state']

0       KS
1       OH
2       NJ
3       OH
4       OK
        ..
3328    AZ
3329    WV
3330    RI
3331    CT
3332    TN
Name: state, Length: 3333, dtype: object

If you want to select more than one column ata time, put them in a list

In [26]:
# This is wrong
# df.loc[:, 'account length', 'area code', 'phone number', 'internationa plan'].head()

In [30]:
df.loc[:, ['account length', 'area code', 'phone number', 'international plan']].head()

   account length  area code phone number international plan
0             128        415     382-4657                 no
1             107        415     371-7191                 no
2             137        415     358-1921                 no
3              84        408     375-9999                yes
4              75        415     330-6626                yes

If  you select contiguous columns, you can use the ":" notation

In [37]:
df.loc[:, 'account length' : 'international plan'].head()

   account length  area code phone number international plan
0             128        415     382-4657                 no
1             107        415     371-7191                 no
2             137        415     358-1921                 no
3              84        408     375-9999                yes
4              75        415     330-6626                yes

**.iloc example**

In [42]:
df.iloc[[0,1,2,3,4], [1,2,3,4]]

   account length  area code phone number international plan
0             128        415     382-4657                 no
1             107        415     371-7191                 no
2             137        415     358-1921                 no
3              84        408     375-9999                yes
4              75        415     330-6626                yes

In [44]:
# Another way
df.iloc[0:5, 1:5]

   account length  area code phone number international plan
0             128        415     382-4657                 no
1             107        415     371-7191                 no
2             137        415     358-1921                 no
3              84        408     375-9999                yes
4              75        415     330-6626                yes

**.at and .iat examples**

at and iat provide access to scalar, that is a single element in the dataframe.

**Advantage**: It is much faster than doing operations with .loc and .iloc

In [51]:
#  access single element with iat
df.iat[1,1]

107

In [53]:
df.at[1, 'account length']

107

**Mini Challenge**

1. Get the  row before the last low from the dataframe
2. Create a new column called 'minutes per call'

In [63]:
# To get the number of rows
df.shape[0]

3333

In [69]:
df.iloc[df.shape[0]-2,  :]

state                           CT
account length                 184
area code                      510
phone number              364-6381
international plan             yes
voice mail plan                 no
number vmail messages            0
total day minutes            213.8
total day calls                105
total day charge             36.35
total eve minutes            159.6
total eve calls                 84
total eve charge             13.57
total night minutes          139.2
total night calls              137
total night charge            6.26
total intl minutes             5.0
total intl calls                10
total intl charge             1.35
customer service calls           2
churn                        False
Name: 3331, dtype: object

# Gain speed usinng .at and .iat

The main advantage of using .at and .iat is speed

Let's compare the time taken to compute the hypothenus using .loc vs .iat method

In [76]:
import numpy as np
import pandas as pd

nrow = 10000
arr = np.random.randint(0, 100, (nrow, 3))
df = pd.DataFrame(arr, columns=['A', 'B', 'C'])
df.head()

    A   B   C
0  59  41  58
1  50  75  65
2  98  61  59
3  96  94  39
4  52  95  50

Define the function. We are  going to iterate the rows of the dataframe and apply this function for each row and assign the return value to one of the columns in the dataframe itself.

In [79]:
def hypotenuse(a, b):
    return np.sqrt(a^2 + b^2)

In [81]:
def myfunc(a, b):
    if a > b:
        return 1
    else:
        return 0

**Using df.loc**

In [84]:
%%time
for i in range(nrow):
    A = df.loc[i, 'A']
    B = df.loc[i, 'B']
    df.loc[i, 'C'] = hypotenuse(A, B)

<timed exec>:4: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value '4.242640687119285' has dtype incompatible with int32, please explicitly cast to a compatible dtype first.

CPU times: total: 2.3 s
Wall time: 2.3 s

**Using df.at**

In [90]:
%%time
for i in range(nrow):
    A = df.at[i, 'A']
    B = df.at[i, 'B']
    df.at[i, 'C'] = hypotenuse(A, B)

CPU times: total: 781 ms
Wall time: 785 ms

The gains pile up when you increase the size of data.

**Using df.iat**

In [94]:
%%time
for i in range(nrow):
    A = df.at[i, 'A']
    B = df.at[i, 'B']
    df.at[i, 'C'] = hypotenuse(A, B)

df.head()

CPU times: total: 797 ms
Wall time: 811 ms

    A   B          C
0  59  41   4.242641
1  50  75  11.180340
2  98  61   9.746794
3  96  94   1.414214
4  52  95   9.327379

However, use vectorization wherever possible, because thats usually the fastest

**Using vectorization**

In [98]:
%%time
df['C'] = np.sqrt(df['A']^2 + df['B']^2)

CPU times: total: 46.9 ms
Wall time: 43 ms

In [100]:
df.head()

    A   B          C
0  59  41   4.242641
1  50  75  11.180340
2  98  61   9.746794
3  96  94   1.414214
4  52  95   9.327379

In [102]:
%%time
df['C'] = np.sqrt(df.loc[:, 'A']^2 + df.loc[:, 'B']^2)

CPU times: total: 0 ns
Wall time: 0 ns

In [104]:
df.head()

    A   B          C
0  59  41   4.242641
1  50  75  11.180340
2  98  61   9.746794
3  96  94   1.414214
4  52  95   9.327379